const val digits = "1234567890"
val englishABC = "abcdefghijklmnopqrstuvwxyz$digits".toUpperCase()
val russianABC = "абвгдеёжзийклмнопрстуфхцчшщъыьэюя$digits".toUpperCase()

enum class ABC {
    ENG, RUS
}

const val exampleText = "Когда вы впервые собираете деньги на проект, сначала спросите себя: «В нас стоит инвестировать?» Честный ответ на этот вопрос поможет и в следующий раз. Не рекламируйте. Говорите правду, и пусть инвесторы читают по глазам. Есть три условия успешного стартапа: работать с хорошими людьми, делать то, что нужно клиентам, и тратить как можно меньше." +
        "Один из способов развивать стартап — делайте продукт, который нравится пользователям. Начните с чего-то простого и лёгкого, чем бы вы тоже пользовались. Выпустите версию 1.0 как можно скорее и продолжайте работать. Прислушивайтесь к пользователям, потому что клиент всегда прав. Но разные клиенты правы по-разному. Неопытные подскажут вам, что нужно упростить, а искушённые пользователи расскажут, какие функции стоит добавить." +
        "Стартапы проваливаются из-за того, что, во-первых, делают продукт, который никому не нужен, во-вторых, тратят слишком много времени и денег. Эти две причины убили так много стартапов, что я даже не уверен, существует ли третья. Так что если вы создаете что-то нужное и не слишком тратитесь на это — то вы на правильном пути." +
        "Когда вы впервые собираете деньги на проект, сначала спросите себя: «В нас стоит инвестировать?» Честный ответ на этот вопрос поможет и в следующий раз. Не рекламируйте. Говорите правду, и пусть инвесторы читают по глазам. Есть три условия успешного стартапа: работать с хорошими людьми, делать то, что нужно клиентам, и тратить как можно меньше." +
        "Один из способов развивать стартап — делайте продукт, который нравится пользователям. Начните с чего-то простого и лёгкого, чем бы вы тоже пользовались. Выпустите версию 1.0 как можно скорее и продолжайте работать. Прислушивайтесь к пользователям, потому что клиент всегда прав. Но разные клиенты правы по-разному. Неопытные подскажут вам, что нужно упростить, а искушённые пользователи расскажут, какие функции стоит добавить." +
        "Стартапы проваливаются из-за того, что, во-первых, делают продукт, который никому не нужен, во-вторых, тратят слишком много времени и денег. Эти две причины убили так много стартапов, что я даже не уверен, существует ли третья. Так что если вы создаете что-то нужное и не слишком тратитесь на это — то вы на правильном пути."

const val MODE = "-mode"
const val KEY_LENGTH = "-keyLength"
const val STEP = "-step"

const val FIRST_TASK_OUTPUT = "firstTask"
const val KEY_PATH = "key.txt"
const val VIGENER_KEY_PATH = "vigenerKey.txt"
const val OPEN_MESSAGE = "openMessage.txt"
const val ENCRYPTED_TEXT = "encryptedText.txt"
const val DECRYPTED_TEXT = "decryptedText.txt"
const val VIGENER_ENCRYPTED_TEXT = "vigenerEncryptedText.txt"
const val VIGENER_DECRYPTED_TEXT = "vigenerDecryptedText.txt"


const val SECOND_TASK_OUTPUT = "secondTask"
